app/controllers/notes_controller.rb

SELECT COUNT(*) FROM `notes` WHERE (title LIKE '%third%')
SELECT  `notes`.* FROM `notes` WHERE `notes`.`user_id` = 2  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `notes` WHERE `notes`.`user_id` = 20
---
  def index
    if params[:search]
      #@notes = Note.where(["title LIKE ?", "%#{params[:search]}%"])
      @notes = Note.search(params[:search]).order("created_at DESC").paginate(:page => params[:page], :per_page => 10)
    else
      @notes = @user.notes.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)

INSERT INTO `notes` (`title`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('Note 1', 'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout. The point of using Lorem Ipsum is that it has a more-or-less normal distribution of letters, as opposed to using \'Content here, content here\', making it look like readable English. Many desktop publishing packages and web page editors now use Lorem Ipsum as their default model text, and a search for \'lorem ipsum\' will uncover many web sites still in their infancy. Various versions have evolved over the years, sometimes by accident, sometimes on purpose (injected humour and the like).', 1, '2015-10-21 13:16:25', '2015-10-21 13:16:25')
---
  def create
    @note = Note.new(note_params)
    @note.user = current_user
    if @note.save

UPDATE `notes` SET `content` = '<b>There</b> are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don\'t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn\'t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.', `updated_at` = '2015-10-23 14:20:59' WHERE `notes`.`id` = 8
---
  def update
    if @note.update(note_params)

SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 6 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def delete
    @user = Note.find(params[:id]).user

SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 6 LIMIT 1
DELETE FROM `notes` WHERE `notes`.`id` = 6
---
  def destroy
    note = Note.find(params[:id])
    note.destroy

SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 2 LIMIT 1
---
  def find_note
    @note = Note.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 20 LIMIT 1
---
def find_user
  @user = User.find(session[:user_id])