app/controllers/users_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `username`, `email`, `password_digest`, `profile_picture_file_name`, `profile_picture_content_type`, `profile_picture_file_size`, `profile_picture_updated_at`, `created_at`, `updated_at`) VALUES ('sfdanb s', 'dfnsbdv', 'asdfgh', 'asdfgh', '$2a$10$vS1nKsEi9BJ5GHYwrYpseOpkd7enPVahhkNZq.eZX62oZETXNvRce', 'Screenshot_from_2015-10-24_15_07_29.png', 'image/png', 176049, '2015-10-24 10:08:50', '2015-10-24 10:08:50', '2015-10-24 10:08:50')
---
  def create
  	@user = User.new(user_params)
  	if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$6xy5blVzh5YUDTnsz0.VrOyedB146ySOUuIdWV11SpIXtVQRZ9vuO', `profile_picture_file_name` = 'Screenshot_from_2015-10-24_15_07_29.png', `profile_picture_file_size` = 176049, `profile_picture_updated_at` = '2015-10-24 19:10:10', `updated_at` = '2015-10-24 19:10:10' WHERE `users`.`id` = 7
---
  def update
  	@user = User.find(params[:id])
    if @user.update_attributes(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'mohankrishnanalluri@gmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def attempt_login

  	if params[:email].present? && params[:password].present?
  		found_user = User.where(:email => params[:email]).first